package Lesson10;

import static Lesson9.Car.ab;

public class A {
 public static void main(String[] args) {

    System.out.println(ab);


 }
}

/*
Create package p1, in it class A. In package p1 create a subpackage p2, in it
class B with static members. In the p2 subpackage, create the p3 subpackage, in it
class C. Create a new package p4, in it class D. In package p4, create
subpackage p5, in it class E. Inside class D write the code that
will use any elements of classes A, C, E, as well as static
members of class B. Using the import and static import statements,
work with incomplete class names.


Создайте пакет р1, в нём класс А. В пакете р1 создайте подпакет р2, в нём
класс В со static элементами. В подпакете р2 создайте подпакет р3, в нём
класс С. Создайте новый пакет р4, в нём класс D. В пакете р4 создайте
подпакет р5, в нём класс Е. Внутри класса D напишите код, который
будет задействовать любые элементы классов А, С, Е, а также static
элементы класса В. Используя выражения import и static import,
работайте с не полными именами классов.

*/